"""
转换
"""
# complex(real,[,image])
# 创建一个复数

# int(x[,base])
# 将一个字符转换为int类型，base表示字符的进制

# float(x)
# 将一个字符串或数字转换为浮点数。若无参数将返回0.0

# long(x,[base])
# 将一个字符转换为long类型，base表示字符的进制

# bin(x)
# 将整数转换为二进制

# oct(x)
# 将整数转换为八进制

# hex(x)
# 将整数转换为十六进制

# chr(x)
# 返回整数对应的ASCII字符

# bool(x)
# 将x转换为布尔类型

"""
计算
"""
# abs(x)
# 返回数字的绝对值,若是复数，则返回复数的模

# round(x [,n])
# 返回浮点数x的四舍五入值，如给出n值，则代表舍入到小数点后的位数。

# max(x1, x2,...)
# 返回给定参数的最大值，参数可以为序列

# min(x1, x2,...)
# 返回给定参数的最小值，参数可以为序列。

# divmod(a,b)
# 分别取商和余数，整型、浮点型都可以

# sum(sequence[,start])
# 对一序列数字求和

# pow(x, y)
# x**y 运算后的值。

# range([start,]stop[,step])
# 产生一个序列，默认从0开始

# dir()
# 返回关于任何值得相关信息
# 可用于字符串、数字、函数、模块、对象和类

# eval()
# 可以计算表达式的值

# len()
# 返回一个对象的长度




