"""
三种不同的数值类型
"""
# int
#是正或负整数，不带小数点。Python3 整型是没有限制大小的，可以当作 Long 类型使用

# float
# 由整数部分与小数部分组成，浮点型也可以使用科学计数法表示（2.5e2 = 2.5 x 10^2 = 250）

# complex
# 由实数部分和虚数部分构成，可以用a + bj,或者complex(a,b)表示， 复数的实部a和虚部b都是浮点型

"""
整数型数字的不同进制
"""
# 二进制
# 以0b开头

# 八进制
# 以0o开头

# 十六进制
# 以0x开头

# 十机制转十六进制
print(hex(13)

# 十进制转八进制
print(oct(9))

# 十进制转二进制
print(bin(3))

#十六转换为十进制输出
print(int('0xA0F',16))

#八转换为十进制输出
print(int('0o11',8))

#二转换为十进制输出
print(int('0b10',2))

"""
类型的转换，参看”类型转化“
"""

"""
数字运算，参看”运算符“
"""

"""
数学常量
"""
# pi,圆周率
# e，自然常数
















